{"title_one":"iPhone X : Review",
 "article_one":"Welcome to my ongoing impressions of the iPhone X. I've entered my third full day with the phone. Day 2 was mostly a blur of media hits, after a nearly sleepless night. Everything you're reading here is new as of the afternoon of Wednesday, November 1. I'm a pretty quick adopter of weird, new tech. The iPhone X isn't even that weird: it's really an evolved iPhone, with a sharp design and some new ways to use it. But I found, sure enough, that my first day with Apple's top-end phone was a learning process. Face ID and its log-in process. All the new swipes and gestures and button-presses. Learning to accept The Notch In The Screen.Apple itself is calling it the future of the smartphone, the embodiment of what it’s been trying to achieve for a decade. But while the iPhone X is all about premium parts and an all-new experience, it’s a huge gamble for the Cupertino brand too as it tries to reclaim some leadership in smartphone innovation.Losing key, reliable elements like the Touch ID fingerprint scanner, the home button; introducing new methods of navigating and unlocking the phone – and charging a lot more for the privilege – seems risky for a company that was already treading new ground by doing away with the traditional headphone jack last year.But the iPhone X is the handset we’ve been demanding from Apple for years – a world away from the increasingly-tired designs that those who just want a new iPhone have had to make do with. ",
 "title_two":"Galaxy S8 : Review",
 "article_two":"It’s been a few months since the Samsung Galaxy S8 hit shelves, and it’s fair to say it’s changes phones a bit. Since Samsung unleashed its 2017 flagships the edge-to-edge design it started has spread. Now the Google Pixel 2 XL, iPhone X, LG V30 and Huawei Mate 10 Pro have it. But is the S8 still king?",
 "about":"Gadget freak is the original home for technology news and reviews. Since our founding in 2004, we've grown from an exhaustive source for consumer tech news to a global multimedia organization covering the intersection of technology, gaming and entertainment. Today, Engadget hosts the archives and expertise of early digital publishing players like Joystiq, TUAW and gdgt, and produces the Internet's most compelling videos, reviews, features and breaking news about the people, products and ideas shaping our world.After 13 years in the game, we're leveraging our history to bring the future into focus."}